{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "C\\(=O\\)|\\(=O\\)N|\\[C@H\\]|1ccc\\(|C@@H\\]|@H\\]\\(|\\(=O\\)|NC\\(=O|\\[C@@H|ccc\\(|C\\(=O|=O\\)N|\\[C@@|ccccc|c2ccc|c1ccc|c2cc|cccc|@H\\]|=O\\)|c1cc|C\\(=|cc\\(|\\(=O|1ccc|\\[C@|ccc|\\(C|\\)c|c1c|c\\(|C\\(|CCC|1cc|O\\)|\\-|=O|c1|\\[|cc|\\(|\\+|\\ |\\\\|\\.|\\#|\\)|\\]|CC|c2|\\*|4|I|/|%|b|@|L|g|N|c|M|0|o|R|B|i|9|l|d|5|S|s|:|e|r|8|H|A|V|6|C|u|P|Z|t|1|W|K|=|2|n|F|7|T|3|O|a|G"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      " ": 5,
      "#": 6,
      "$": 7,
      "%": 8,
      "(": 9,
      ")": 10,
      "*": 11,
      "+": 12,
      ",": 13,
      "-": 14,
      ".": 15,
      "/": 16,
      "0": 17,
      "1": 18,
      "2": 19,
      "3": 20,
      "4": 21,
      "5": 22,
      "6": 23,
      "7": 24,
      "8": 25,
      "9": 26,
      ":": 27,
      ";": 28,
      "=": 29,
      "@": 30,
      "A": 31,
      "B": 32,
      "C": 33,
      "F": 34,
      "G": 35,
      "H": 36,
      "I": 37,
      "K": 38,
      "L": 39,
      "M": 40,
      "N": 41,
      "O": 42,
      "P": 43,
      "R": 44,
      "S": 45,
      "T": 46,
      "V": 47,
      "W": 48,
      "Z": 49,
      "[": 50,
      "\\": 51,
      "]": 52,
      "_": 53,
      "a": 54,
      "b": 55,
      "c": 56,
      "d": 57,
      "e": 58,
      "g": 59,
      "i": 60,
      "l": 61,
      "n": 62,
      "o": 63,
      "r": 64,
      "s": 65,
      "t": 66,
      "u": 67,
      "|": 68,
      "##c": 69,
      "##(": 70,
      "##=": 71,
      "##1": 72,
      "##$": 73,
      "##;": 74,
      "##_": 75,
      "##C": 76,
      "##@": 77,
      "##O": 78,
      "##)": 79,
      "##2": 80,
      "##,": 81,
      "##H": 82,
      "##]": 83,
      "##N": 84,
      "##cc": 85,
      "c1": 86,
      "CC": 87,
      "(C": 88,
      ")c": 89,
      "##=O": 90,
      "##ccc": 91,
      "C(": 92,
      "[C": 93,
      "[C@": 94,
      "##=O)": 95,
      "cc": 96,
      "c2": 97,
      "c(": 98,
      "c1ccc": 99
    }
  }
}